export const COST_OF_LIFE_EVALUATION = [
  {
    id: 1,
    title:
      "ฉัน กล้ายืนหยัดในสิ่งที่ฉันเชื่อ เช่น กล้าเสนอความคิดเห็น แม้ว่าบางครั้งจะมีความเห็นแตกต่างจากผู้อื่น",
  },
  {
    id: 2,
    title: "ฉัน พูดความจริงเสมอถึงแม้บางครั้งมันจะทำได้ยาก",
  },
  {
    id: 3,
    title: "ฉัน มีการวางแผนและการตัดสินใจก่อนลงมือทำเสมอ",
  },
  {
    id: 4,
    title:
      "ฉัน เรียนรู้และสามารถปรับตัวให้อยู่ร่วมกับคนที่มีความคิดเห็น หรือการดำเนินชีวิตแตกต่างกันได้เป็นอย่างดี",
  },
  {
    id: 5,
    title:
      "ฉัน พยายามแก้ปัญหาข้อขัดย้งด้วยสติปัญญามากกว่าอารมณ์ (ไม่ใช้ความรุนแรง)",
  },
  {
    id: 6,
    title: "ฉัน รู้สึกพึงพอใจในชีวิตความเป็นอยู่ของตัวเอง",
  },
  {
    id: 7,
    title:
      "ฉัน ได้รับความรัก ความอบอุ่น เอาใจใส่ และการสนับสนุนในทางที่ดีจากครอบครัว",
  },
  {
    id: 8,
    title:
      "ฉัน ปรึกษาหารือ และขอคำแนะนำจากผู้ปกครองได้อย่างสบายใจไม่ว่าเรื่องเล็กหรือเรื่องใหญ่",
  },
  {
    id: 9,
    title: "ฉัน รู้สึกปลอดภัย อบอุ่น และมีความสุขเมื่ออยู่ในครอบครัวตัวเอง",
  },
  {
    id: 10,
    title:
      "ฉัน อยู่ในครอบครัวที่มีระเบียบกฏเกณฑ์ชัดเจน มีเหคุผล และมีการดูแลให้ปฏิบัติตาม",
  },
  {
    id: 11,
    title: "ฉัน มีผู้ปกครองที่เป็นแบบอย่างที่ดีให้ทำตาม",
  },
  {
    id: 12,
    title: "ฉัน รู้สึกปลอดภัยเมื่ออยู่ในสถาบันการศึกษา",
  },
  {
    id: 13,
    title: "ฉัน อยากเรียนให้ได้ดี ไม่เอาเปรียบ และรู้จักแบ่งปันผู้อื่น",
  },
  {
    id: 14,
    title: "ฉัน ใฝ่รู้ภูมิปัญญา และวัฒนธรรมของชุมชน",
  },
  {
    id: 15,
    title:
      "ฉัน สามารถพูดคุยแลกเปลี่ยนเรียนรู้เรื่องราวเกี่ยวกับสื่อ เช่น รายการทีวี ข่าวในกระแสสังคม  ยูทูป หรือ ติ๊กต๊อกที่น่าสนใจ กับครอบครัวเป็นประจำ",
  },
  {
    id: 16,
    title: "ฉัน ร่วมกิจกรรมทางศาสนาเป็นประจำ",
  },
  {
    id: 17,
    title: "ฉัน และเพื่อนชวนกันทำกิจกรรมที่ดีเป็นประจำ",
  },
  {
    id: 18,
    title:
      "ฉัน มีญาติหรือผู้ใหญ่ นอกเหนือจากผู้ปกครองที่ฉันสามารถปรึกษาหารือ และขอความช่วยเหลือได้อย่างสบายใจ",
  },
  {
    id: 19,
    title: "ฉัน ร่วมทำกิจกรรมบำเพ็ญประโยชน์ในชุมชนเป็นประจำ",
  },
  {
    id: 20,
    title:
      "ฉัน รู้สึกอบอุ่น มีความสุข และภูมิใจในวิถีชีวิตเมื่ออยู่ในชุมชนของฉัน",
  },
];

export const POSITIVE_PARENTING_EVALUATION = [
  {
    step: 1,
    title:
      "การมีส่วนร่วมในการกำหนดเป้าหมายการใช้ชีวิตของลูก ขอบเขตพฤติกรรม และกฎระเบียบภายในบ้าน (เข้มงวด–ตามใจ)",
    questions: [
      {
        id: 1,
        title: "ฉันให้อิสระลูกในการกำหนดเป้าหมายชีวิตของตนเองระดับใด",
        textLeast: "ฉันเป็นคนกำหนดให้",
        textMost: "ลูกเป็นคนกำหนดเอง",
      },
      {
        id: 2,
        title: "ฉันให้ลูกมีส่วนร่วมในการกำหนดกฎกติกาในบ้านระดับใด",
        textLeast: "ฉันเป็นคนกำหนดให้",
        textMost: "ลูกเป็นคนกำหนดเอง",
      },
      {
        id: 3,
        title: "ฉันให้อิสระลูกในการคิดแก้ไขปัญหาด้วยตนเองระดับใด",
        textLeast: "ฉันเป็นคนคิดแก้ไขปัญหาให้",
        textMost: "ลูกเป็นคนคิดแก้ไขปัญหาเอง",
      },
      {
        id: 4,
        title:
          "ฉันให้อิสระลูกในการเลือกทำกิจกรรมสร้างสรรค์ตามที่ลูกสนใจระดับใด",
        textLeast: "ฉันเป็นคนเลือกเองให้",
        textMost: "ลูกเป็นคนเลือกเอง",
      },
      {
        id: 5,
        title: "ฉันให้อิสระลูกแสดงความคิดเห็นระดับใด",
        textLeast: "ฉันแสดงความคิดเห็นแทนลูก",
        textMost: "ลูกแสดงความคิดเห็นตนเองอย่างอิสระ",
      },
    ],
  },
  {
    step: 2,
    title: "การยอมรับ และตอบสนองความต้องการตามวัย",
    questions: [
      {
        id: 6,
        title: "ฉันดูแลสไตล์การแต่งตัวของลูกระดับใด",
        textLeast: "ฉันไม่ได้ดูแลสไตล์การแต่งตัวของลูก    ",
        textMost: "ฉันดูแลทุกสไตล์การแต่งตัวของลูก",
      },
      {
        id: 7,
        title: "ฉันใส่ใจเลือกเพื่อนให้ลูกระดับใด",
        textLeast: "ฉันไม่ใส่ใจเลือกเพื่อนให้ลูก",
        textMost: "ฉันต้องเป็นคนเลือกเพื่อนให้ลูก",
      },
      {
        id: 8,
        title: "ฉันใส่ใจเลือกคนรักของลูกระดับใด",
        textLeast: "ฉันไม่ใส่ใจเลือกคนรักให้ลูก",
        textMost: "ฉันต้องเป็นคนเลือกคนรักให้ลูก",
      },
      {
        id: 9,
        title: "เมื่อลูกมีอารมณ์แปรปรวน",
        textLeast: "ฉันไม่สนใจอารมณ์แปรปรวนของลูก",
        textMost: "ฉันเฝ้าระวังไม่ให้ลูกมีอารมณ์แปรปรวนเลย",
      },
      {
        id: 10,
        title: "ฉันระวังลูกจากการทำผิดพลาดระดับใด",
        textLeast: "ฉันไม่สนใจการกระทำของลูก",
        textMost: "ฉันเฝ้าระวังไม่ให้ลูกทำอะไรผิดพลาดเลย",
      },
      {
        id: 11,
        title: "ฉันใส่ใจเรื่องการคบเพื่อนของลูกระดับใด",
        textLeast: "ฉันไม่ใส่ใจเรื่องการคบเพื่อนของลูก",
        textMost: "ฉันเฝ้าระวังไม่ให้ลูกคบเพื่อน",
      },
      {
        id: 12,
        title: "ฉันใส่ใจเรื่องการคบแฟนของลูกระดับใด",
        textLeast: "ฉันไม่สนใจเรื่องการคบแฟนของลูก",
        textMost: "ฉันเฝ้าระวังไม่ให้ลูกมีแฟน",
      },
      {
        id: 13,
        title: "ฉันให้ลูกวัยรุ่นรับผิดชอบเรื่องของตนเองในระดับใด",
        textLeast: "ฉันปล่อยให้ลูกรับผิดชอบตนเองทุกเรื่อง",
        textMost: "ฉันรับผิดชอบให้ทุกเรื่อง",
      },
      {
        id: 14,
        title: "ฉันให้ลูกวัยรุ่นรับผิดชอบเรื่องงานบ้านในระดับใด",
        textLeast: "ฉันปล่อยให้ลูกรับผิดชอบงานบ้านทุกเรื่อง",
        textMost: "ฉันรับผิดชอบเองทุกเรื่อง",
      },
      {
        id: 15,
        title: "ฉันให้ลูกรับผิดชอบเรื่องค่าใช้จ่ายของลูกระดับใด",
        textLeast: "ฉันรับผิดชอบน้อย ลูกรับผิดชอบมาก",
        textMost: "ฉันรับผิดชอบทุกเรื่องแม้ค่าใช่จ่ายที่ไม่จำเป็น",
      },
      {
        id: 16,
        title: "เมื่อลูกวัยรุ่นอยากรู้อยากลองในสิ่งต่างๆ",
        textLeast: "ฉันไม่สนใจ",
        textMost: "ฉันห้ามทุกสิ่งที่ลูกอยากรู้อยากลอง",
      },
    ],
  },
  {
    step: 3,
    title: "ทักษะการใช้เทคนิคการสร้างวินัยเชิงบวก (เชิงลบ - เชิงบวก)",
    questions: [
      {
        id: 17,
        title:
          "ฉันแสดงความรักในรูปแบบที่ลูกต้องการบ่อยระดับใด (เช่น การสัมผัส บอกรัก แสดงความเข้าใจ เป็นต้น)",
        textLeast: "ไม่บ่อย",
        textMost: "บ่อย",
      },
      {
        id: 18,
        title: "ฉันมีเวลาพูดคุย ให้คำปรึกษาแนะนำกับลูกบ่อยระดับใด",
        textLeast: "ไม่บ่อย",
        textMost: "บ่อย",
      },
      {
        id: 19,
        title: "ฉันไวต่ออารมณ์ความรู้สึกของลูกในสถานการณ์ต่างๆ ระดับใด",
        textLeast: "ฉันไม่ไวต่ออารมณ์ความรู้สึกของลูก",
        textMost: "ฉันรับรู้อารมณ์ความรู้สึกลูกได้ทันที",
      },
      {
        id: 20,
        title: "ฉันและลูกมีสัมพันธภาพกันระดับใด",
        textLeast: "เหินห่าง",
        textMost: "ใกล้ชิด",
      },
      {
        id: 21,
        title: "ครอบครัวของฉันมีความอบอุ่นระดับใด",
        textLeast: "ไม่อบอุ่น",
        textMost: "อบอุ่นมาก",
      },
      {
        id: 22,
        title: "ฉันมีความมั่นคงทางอารมณ์ระดับใด",
        textLeast: "ไม่มีความมั่นคงทางอารมณ์",
        textMost: "มีความมั่นคงทางอารมณ์มาก",
      },
      {
        id: 23,
        title: "ฉันเป็นพ่อแม่ที่มีความปลอดภัยระดับใด",
        textLeast: "ไม่ปลอดภัย",
        textMost: "ปลอดภัยมาก",
      },
      {
        id: 24,
        title:
          "ฉันชมลูกถึงคุณค่าบ่อยระดับใด เช่น เป็นคนมีน้ำใจ เป็นคนกตัญญู เป็นคนมีความรับผิดชอบ เป็นคนแก้ไขปัญหาเก่ง เป็นต้น",
        textLeast: "ไม่เคยชม",
        textMost: "ชมบ่อยมาก",
      },
      {
        id: 25,
        title: "ฉันมีวิธีการทำให้ลูกมีพฤติกรรมตามที่คาดหวังระดับใด",
        textLeast: "สั่งให้ทำ",
        textMost: "สอนทักษะ",
      },
      {
        id: 26,
        title: "ฉันตำหนิลูกบ่อยระดับใด (Reverse)",
        textLeast: "ไม่เคยตำหนิ",
        textMost: "ตำหนิบ่อยมาก",
      },
      {
        id: 27,
        title:
          "ฉันทำโทษลูกให้ได้รับความเจ็บปวดทางกาย หรือทางใจบ่อยระดับใด (Reverse)",
        textLeast: "ไม่เคยทำ",
        textMost: "ทำเป็นประจำ",
      },
      {
        id: 28,
        title: "ฉันตำหนิลูกต่อหน้าผู้อื่นบ่อยระดับใด (Reverse)",
        textLeast: "ไม่เคยทำ",
        textMost: "ทำบ่อยมาก",
      },
      {
        id: 29,
        title: "ฉันเปรียบเทียบลูกกับคนอื่นบ่อยในระดับใด (Reverse)",
        textLeast: "ไม่เคยทำ",
        textMost: "ทำบ่อยมาก",
      },
    ],
  },
];
