import WrapperLayout from "@/components/Layout";
import React from "react";
import AdviceInfo from "./components/AdviceInfo";
import { Box, Button, Typography } from "@mui/material";

type Props = {};

const PositiveParentingAdvice = (props: Props) => {
  return (
    <main style={{ background: "#8ACEFC", minHeight: "100vh" }}>
      <WrapperLayout>
        <AdviceInfo
          src="/static/profile/doctor1.png"
          title="แบบประเมินการเลี้ยงดูเชิงบวก"
        >
          <Typography>
            “ไม่มีพ่อแม่คนไหนไม่รักลูก”
            แต่เพราะพ่อแม่มีรูปแบบการดูแลเลี้ยงดูลูกที่แตกต่างกันออกไป
            ทำให้การสื่อสารความรัก ความห่วงใย และวิธีการสอนมีความแตกต่างกัน
            พ่อแม่บางคนแสดงความรัก ความห่วงใยลูก ด้วยความเข้มงวด
            ในขณะที่พ่อแม่บางคนแสดงความรัก ความห่วงใยลูก ด้วยการตามใจ
            หรือพ่อแม่บางคนเก็บความรัก ความห่วงใยลูกไว้ลึกสุดใจ ไม่แสดงออก
            ไม่ว่าการดูแลเลี้ยงดูลูกจะเป็นรูปแบบใด
            สิ่งสำคัญที่พ่อแม่จำเป็นต้องตระหนักรู้ คือ
            การดูแลเลี้ยงดูลูกแต่ละรูปแบบ
            ตอบสนองความต้องการตามวัยของลูกได้ไม่เท่ากัน
            ส่งผลให้การสื่อสารความรัก ความห่วงใยของพ่อแม่ไปถึงลูกได้ไม่เท่ากัน
            และแน่นอนว่า ผลลัพธ์จากการดูแลเลี้ยงดูลูกย่อมแตกต่างกัน
            <br />
            <br />
            เด็กวัยรุ่น (12 – 20 ปี)
            เป็นวัยที่มีการเปลี่ยนแปลงครั้งยิ่งใหญ่ทั้งทางด้านร่างกาย อามร์จิตใจ
            สังคม และสติปัญญา
            และเป็นช่วงวัยสุดท้ายที่กำลังจะก้าวข้ามจากวัยเด็กสู่วัยผู้ใหญ่
            ความต้องการตามวัยที่สำคัญ คือ
            การสร้างตัวตนของตนเองให้มีความรู้สึกนึกคิด ความเชื่อ ความสามารถ
            และคุณค่าของตนเองที่ชัดเจน
            และการสร้างตัวตนของตนเองให้ได้รับการยอมรับจากครอบครัว
            และผู้อื่นในสังคม ดังนั้นรูปแบบการเลี้ยงดู
            ที่สามารถตอบสนองความต้องการตามวัยของวัยรุ่นได้ 3 ด้าน ได้แก่
            รูปแบบการดูแลเลี้ยงดูแบบมีส่วนร่วม
            รูปแบบการดูแลเลี้ยงดูที่เหมาะสมตามวัย และ รูปแบบการเลี้ยงดูเชิงบวก
            จึงเป็นกุญแจสำคัญที่ช่วยส่งเสริมลูกให้สามารถก้าวข้ามพัฒนาการช่วงวัยรุ่นไปสู่วัยผู้ใหญ่ได้อย่างมีคุณภาพ
            และมีความสุข
            <br />
            <br />
            แบบประเมินรูปแบบการดูแลเลี้ยงดูนี้ เป็นเครื่องมือสำหรับพ่อแม่
            ผู้ปกครองของเด็กวัยรุ่น
            ในการค้นหารูปแบบการดูแลเลี้ยงดูลูกของตนเองว่าเป็นรูปแบบใด
            รวมถึงมีการนำเสนอข้อมูลทางวิชาการ และ
            วิธีการดูแลเลี้ยงดูลูกที่สอดคล้องกับพัฒนาการ
            และความต้องการตามวัยของลูกวัยรุ่น เพื่อเป็นเพื่อนคู่คิด
            ให้พ่อแม่และผู้ปกครอง ดูแล เลี้ยงดูลูกด้วยความเข้าใจ สนุก
            และมีความสุข
          </Typography>
          <Box textAlign={"center"} paddingBottom={"40px"}>
            <Button
              href="evaluation-form"
              variant="contained"
              sx={{
                marginTop: "23px",
                backgroundColor: "#8ACEFC",
                padding: "13px 66px",
                borderRadius: "20px",
              }}
            >
              <Typography variant="body2" fontWeight={500}>
                ยอมรับ
              </Typography>
            </Button>
          </Box>
        </AdviceInfo>
      </WrapperLayout>
    </main>
  );
};

export default PositiveParentingAdvice;
